In [170]:
import pandas as pd
import numpy as np

In [171]:
df = pd.read_csv('Unclean_Data1.csv', index_col='ID')

In [172]:
df

,Name,Age,Gender,Birth Date,City_State,Height (inches),Weight (lbs),Income ($)
ID,,,,,,,,
1,John Doe,25,M,2003-01-21,"New York, NY",68,160,45000
2,Jane Smith,32,F,3/2/2001,"San Francisco, CA",64,125,"$60,000"
3,Bob Johnson,41,Male,03/03/2001,"Boston, MA",72,190,75K
4,Mary Brown,28,f,2001-03-04,"Chicago, IL",65,130,80000
5,David Lee,36,M,Mar-01,"Dallas, TX",69,220,"90,000"
6,Sarah Chen,29,Female,x3/6/00,"Miami, FL",63,135,"$50,000"
7,Michael Kim,46,m,3/32/99,"Phoenix, AZ",75,250,100000
8,Lisa Davis,31,F,2003-01-22,"Atlanta, GA",66,155,55k
9,Alex Wilson,29,Male,3/2/2002,"Denver, CO",71,175,"70,000"
10,Jessica Brown,42,female,03/03/2002,"New York, NY",62,145,120000
11,Mark Lee,33,M,2001-02-26,"San Francisco, CA",68,160,"65,000"
12,Emily Smith,27,f,Feb-01,"Boston, MA",66,abc,50000
13,Brian Kim,45,Male,x3/6/01,"Chicago, IL",73,300,140K
14,Ashley Chen,30,Female,3/32/00,"Dallas, TX",64,135,"45,000"
15,Jack Johnson,38,m,2003-01-23,"Miami, FL",70,195,"$80,000"
16,Lauren Davis,29,F,3/2/2003,"Phoenix, AZ",63,140,60k
17,Chris Wilson,28,Male,03/03/2003,"Atlanta, GA",68,165,"75,000"
18,Karen Brown,44,female,2001-02-20,"Denver, CO",62,125%,110000
19,Ryan Lee,31,M,Feb-01,"New York, NY",72,190,"50,000"
20,Sarah Smith,35,f,x3/6/02,"San Francisco, CA",65,130,"$70,000"

In [173]:
# Clean Gender

In [174]:
df['Gender_Clean'] = df.Gender.str.lower()

In [175]:
df['Gender_Clean'] = df.Gender_Clean.str[0]

In [176]:
df[['Gender', 'Gender_Clean']]

    Gender Gender_Clean
ID
1        M            m
2        F            f
3     Male            m
4        f            f
5        M            m
6   Female            f
7        m            m
8        F            f
9     Male            m
10  female            f
11       M            m
12       f            f
13    Male            m
14  Female            f
15       m            m
16       F            f
17    Male            m
18  female            f
19       M            m
20       f            f

In [177]:
# Clean Birth Date

In [178]:
df['Birth_Date_Clean'] = df['Birth Date'].str.replace(r'[^0-9/-]', '', regex=True)

In [179]:
df[['Birth Date', 'Birth_Date_Clean']]

    Birth Date Birth_Date_Clean
ID
1   2003-01-21       2003-01-21
2     3/2/2001         3/2/2001
3   03/03/2001       03/03/2001
4   2001-03-04       2001-03-04
5       Mar-01              -01
6      x3/6/00           3/6/00
7      3/32/99          3/32/99
8   2003-01-22       2003-01-22
9     3/2/2002         3/2/2002
10  03/03/2002       03/03/2002
11  2001-02-26       2001-02-26
12      Feb-01              -01
13     x3/6/01           3/6/01
14     3/32/00          3/32/00
15  2003-01-23       2003-01-23
16    3/2/2003         3/2/2003
17  03/03/2003       03/03/2003
18  2001-02-20       2001-02-20
19      Feb-01              -01
20     x3/6/02           3/6/02

In [180]:
df['Birth_Date_Clean'] = pd.to_datetime(df['Birth_Date_Clean'], errors='coerce')

In [181]:
df[['Birth Date', 'Birth_Date_Clean']]

    Birth Date Birth_Date_Clean
ID
1   2003-01-21       2003-01-21
2     3/2/2001       2001-03-02
3   03/03/2001       2001-03-03
4   2001-03-04       2001-03-04
5       Mar-01              NaT
6      x3/6/00       2000-03-06
7      3/32/99              NaT
8   2003-01-22       2003-01-22
9     3/2/2002       2002-03-02
10  03/03/2002       2002-03-03
11  2001-02-26       2001-02-26
12      Feb-01              NaT
13     x3/6/01       2001-03-06
14     3/32/00              NaT
15  2003-01-23       2003-01-23
16    3/2/2003       2003-03-02
17  03/03/2003       2003-03-03
18  2001-02-20       2001-02-20
19      Feb-01              NaT
20     x3/6/02       2002-03-06

In [182]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 20 entries, 1 to 20
Data columns (total 10 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Name              20 non-null     object
 1   Age               20 non-null     int64
 2   Gender            20 non-null     object
 3   Birth Date        20 non-null     object
 4   City_State        20 non-null     object
 5   Height (inches)   20 non-null     int64
 6   Weight (lbs)      20 non-null     object
 7   Income ($)        20 non-null     object
 8   Gender_Clean      20 non-null     object
 9   Birth_Date_Clean  15 non-null     datetime64[ns]
dtypes: datetime64[ns](1), int64(2), object(7)
memory usage: 1.7+ KB

In [183]:
# Clean Weight

In [184]:
df['Weight_Clean'] = df['Weight (lbs)'].str.replace('%', '')

In [185]:
df[['Weight (lbs)', 'Weight_Clean']]

   Weight (lbs) Weight_Clean
ID
1           160          160
2           125          125
3           190          190
4           130          130
5           220          220
6           135          135
7           250          250
8           155          155
9           175          175
10          145          145
11          160          160
12          abc          abc
13          300          300
14          135          135
15          195          195
16          140          140
17          165          165
18         125%          125
19          190          190
20          130          130

In [186]:
# Clean Income

In [187]:
df['Income_Clean'] = df['Income ($)'].str.replace('$', '', regex=True)

In [188]:
df['Income_Clean'] = df.Income_Clean.str.replace('k', '000')

In [189]:
df['Income_Clean'] = df.Income_Clean.str.replace('K', '000')

In [190]:
df['Income_Clean'] = df.Income_Clean.str.replace(',', '')

In [191]:
df[['Income ($)', 'Income_Clean']]

   Income ($) Income_Clean
ID
1       45000        45000
2     $60,000        60000
3         75K        75000
4       80000        80000
5      90,000        90000
6     $50,000        50000
7      100000       100000
8         55k        55000
9      70,000        70000
10     120000       120000
11     65,000        65000
12      50000        50000
13       140K       140000
14     45,000        45000
15    $80,000        80000
16        60k        60000
17     75,000        75000
18     110000       110000
19     50,000        50000
20    $70,000        70000

In [192]:
df.Income_Clean.astype('float64')

ID
1      45000.0
2      60000.0
3      75000.0
4      80000.0
5      90000.0
6      50000.0
7     100000.0
8      55000.0
9      70000.0
10    120000.0
11     65000.0
12     50000.0
13    140000.0
14     45000.0
15     80000.0
16     60000.0
17     75000.0
18    110000.0
19     50000.0
20     70000.0
Name: Income_Clean, dtype: float64

In [193]:
# Clean Weight to remove 'abc'

In [197]:
df['Weight_Clean'] = pd.to_numeric(df.Weight_Clean, errors='coerce')

In [198]:
df[['Weight (lbs)', 'Weight_Clean']]

   Weight (lbs)  Weight_Clean
ID
1           160         160.0
2           125         125.0
3           190         190.0
4           130         130.0
5           220         220.0
6           135         135.0
7           250         250.0
8           155         155.0
9           175         175.0
10          145         145.0
11          160         160.0
12          abc           NaN
13          300         300.0
14          135         135.0
15          195         195.0
16          140         140.0
17          165         165.0
18         125%         125.0
19          190         190.0
20          130         130.0

In [199]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 20 entries, 1 to 20
Data columns (total 12 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Name              20 non-null     object
 1   Age               20 non-null     int64
 2   Gender            20 non-null     object
 3   Birth Date        20 non-null     object
 4   City_State        20 non-null     object
 5   Height (inches)   20 non-null     int64
 6   Weight (lbs)      20 non-null     object
 7   Income ($)        20 non-null     object
 8   Gender_Clean      20 non-null     object
 9   Birth_Date_Clean  15 non-null     datetime64[ns]
 10  Weight_Clean      19 non-null     float64
 11  Income_Clean      20 non-null     object
dtypes: datetime64[ns](1), float64(1), int64(2), object(8)
memory usage: 2.0+ KB

In [200]:
df.Weight_Clean.astype('float16')

ID
1     160.0
2     125.0
3     190.0
4     130.0
5     220.0
6     135.0
7     250.0
8     155.0
9     175.0
10    145.0
11    160.0
12      NaN
13    300.0
14    135.0
15    195.0
16    140.0
17    165.0
18    125.0
19    190.0
20    130.0
Name: Weight_Clean, dtype: float16